# Output ASCII name
""" Скрипт должен вывести  в консоль своё имя, нарисованное 'звёздочками'.
Для выполнения этого задания надо использовать не только символы звёздочки и пробела,
но и ESCAPE символы: \n и \t
"""

name = "*******\t\t*********\t*****\t\t **\t *******\t*********\t*******\n\
**\t\t**\t**\t\t\t**\t**\t\t **  **\t\t**\t**\t\t\t**\t\t**\n\
**\t\t**\t**\t\t\t**\t **\t\t **  **\t\t**\t**\t\t\t**\t\t**\n\
******\t\t*******\t\t**\t  **\t **  **\t\t**\t******\t\t******\n\
**\t\t**\t**\t\t\t**\t   **\t **\t **\t\t**\t**\t\t\t**\t **\n\
**\t\t**\t**\t\t\t**\t\t**\t **\t **\t\t**\t**\t\t\t**\t  **\n\
**\t\t**\t**\t\t\t**\t\t **\t **\t **\t\t**\t**\t\t\t**\t   **\n\
*******\t\t*********\t**\t\t  *****\t *******\t*********\t**\t\t**"

print(name)
